SigninLogs
| where UserId == "" //Use the Object ID from Entra ID of the Breakglass account
| where ResultType == "0"
| where IsInteractive == "true"

//Entity Mapping - [Account] AADUseriD + UserID,  DisplayName = UserDisplayname
