// Show all ASR Events
DeviceEvents
| where Timestamp >= ago(7d)
| where ActionType startswith "Asr"
| project Timestamp, DeviceName, ActionType, FileName, FolderPath, InitiatingProcessFileName, InitiatingProcessCommandLine, AccountName
| order by DeviceName asc
