SecurityEvent
| summarize TimeGenerated = max(TimeGenerated) by Computer
| extend State = iff(TimeGenerated < ago(10m), 'Unhealthy', 'Healthy')
| extend LastLogRecieved = now() - TimeGenerated
| project Computer, State, LastLogRecieved
